request.xml

<?xml version="1.0"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
  <env:Header/>
  <env:Body>
    <ns2:sayHello xmlns:ns2="http://gss.redhat.com/">
      <arg0>Kyle</arg0>
    </ns2:sayHello>
  </env:Body>
</env:Envelope>
